// 首页菜单栏
export const HOME_MENU = [
    {
        key: 0,
        label: '首页',
        type: 'home',
    },
    {
        key: 1,
        label: '智能笔墨',
        type: 'text'
    },
    {
        key: 2,
        label: '视觉魔法',
        type:'picture'
    },
    {
        key: 3,
        label: '文档宝库',
        type: 'file'
    }
];

// 首页宣传语
export const HOME_PROPAGATE = [ 
    '以AI之力，绘就文学华章；融合创意，雕刻艺术边界。AI综合创作平台，赋予文本、图像、文档以灵魂，开启艺术新纪元。',
    'With the power of AI, painting a brilliant chapter of literature; fusing creativity, carving the boundary of art. AI comprehensive creation platform, giving text, image, document with soul, opening a new era of art.'
]

// 首页产品入口
export const HOME_PRODUCT = [
    {
        id: 1,
        productName: '智能笔墨',
        productUrl: '/src/assets/images/text.png',
        productIntroduce: 'AI文本创作功能，启迪灵感，翻转文学，让您轻松创作出令人惊艳的文本作品。',
    },
    {
        id: 2,
        productName: '视觉魔法',
        productUrl: '/src/assets/images/picture.png',
        productIntroduce: 'AI驱动，想象无限，图像创作轻而易举,轻松打造出独具魅力的视觉作品。',
    },
    {
        id: 3,
        productName: '文档宝库',
        productUrl: '/src/assets/images/file.png',
        productIntroduce: 'AI助您文档创作，效率倍增，排版优化，让您的文档更具吸引力和专业性。',
    }
]

//收藏列表(请求获取)
export const COLLECTION_LIST = [
    {
        id: 1,
        title: '收藏标题1',
        answer: '收藏内容122111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        createTime: '2023-03-23 12:00',
        //类型为模板类型，每一个模板都有一个类型，当提问时传递模板类型给后端，后端保存
        type: 'normal'
    },
    {
        id: 2,
        title: '收藏标题2',
        answer: '收藏内容122111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        createTime: '2023-03-23 12:00',
    },
    {
        id: 3,
        title: '收藏标题3',
        answer: '收藏内容122111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        createTime: '2023-03-23 12:00',
    },
    {
        id: 4,
        title: '收藏标题4',
        answer: '收藏内容122111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        createTime: '2023-03-23 12:00',
    },
    {
        id: 5,
        title: '收藏标题5', 
        answer:'收藏内容122111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        createTime: '2023-03-23 12:00',
    }
]


//创作结果页，创作历史记录，需要后端传递
export const RESULT = [
    {
        id: 1,
        type: 'free',
        tempTitle: '自由问答模式',
        question: '问题1111',
        answer: '回答1111',
        create_time: '2020-10-24 11:11',
        is_collect: false,
    },
    {
        id: 2,
        type: 'free',
        tempTitle: '自由问答模式',
        question: '问题2222',
        answer: '回答2222',
        create_time: '2020-10-24 11:11',
        is_collect: true,
    },
    {
        id: 3,
        type: 'free',
        tempTitle: '自由问答模式',
        question: '问题2222',
        answer: '回答2222',
        create_time: '2020-10-24 11:11',
        is_collect: true,
    },
    {
        id: 4,
        type: 'free',
        tempTitle: '自由问答模式',
        question: '问题2222',
        answer: '回答2222',
        create_time: '2020-10-24 11:11',
        is_collect: true,
    },
    {
        id: 5,
        type: 'free',
        tempTitle: '自由问答模式',
        question: '问题2222',
        answer: '回答2222',
        create_time: '2020-10-24 11:11',
        is_collect: true,
    }
]